# StructuralSectionIshapeBoltSpacing Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionIshapeBoltSpacing Property
ParameterTypeId Class See Also
---
"Bolt Spacing"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionIshapeBoltSpacing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionIshapeBoltSpacing As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionIshapeBoltSpacing {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace